Учебные проекты2/Виртуальные таблицы регистров/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Тип</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Учебные проекты2/Виртуальные таблицы регистров/Catalogs/Контрагенты/Ext/ManagerModule.bsl
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	
	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EmailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
	
	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ФактическийАдресКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEmail) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = EmailКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьEmail;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ТелефонКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьТелефон;
		КонецЕсли;
		КонтрагентОбъект.Записать();
	КонецЦикла;
	
	
КонецПроцедуры
